import React from 'react';
import './stages.css';

function Stages(props) {

    function handleTextOpen(e) {
        if (e.target.closest(".stages-item").classList.contains("stages-item-open")) {
            e.target.closest(".stages-item").querySelector(".stages-text-container").classList.remove("stages-text-container-open");
            e.target.closest(".stages-item").querySelector(".stages-text-container").style.setProperty("display", "none")
            e.target.closest(".stages-item").querySelector(".stages-text-container").style.setProperty("height", "0")
            e.target.closest(".stages-item").classList.remove("stages-item-open");
            setTimeout(() => {
                e.target.closest(".stages-item").querySelector(".stages-text-container").classList.remove("stages-text-container-open");
            }, 0)
            return;
        }
        if (document.querySelector(".stages-text-container-open") != null) {
            document.querySelector(".stages-item-open").classList.remove("stages-item-open");
            document.querySelector(".stages-text-container-open").style.setProperty("display", "none");
            document.querySelector(".stages-text-container-open").classList.remove("stages-text-container-open");
            document.querySelector(".stages-text-container").style.setProperty("height", "0");
        }
        e.target.closest(".stages-item").classList.add("stages-item-open");
        e.target.closest(".stages-item").querySelector(".stages-text-container").style.setProperty("display", "flex")
        e.target.closest(".stages-item").querySelector(".stages-text-container").style.setProperty("height", "auto")
        setTimeout(() => {
            e.target.closest(".stages-item").querySelector(".stages-text-container").classList.add("stages-text-container-open");
        }, 0)
        return;
    }

    return (
        <section className="stages" id='Stages'>
            <h2 className="section-title stages-title">Этапы работы</h2>
            <div className="stages-background"></div>
            <div className="stages-container">
                <ul className="stages-list">
                    <li className="stages-item">
                        <div className="stages-subtitle-container" onClick={handleTextOpen}>
                            <h3 className="stages-subtitle">1. Диагностическая консультация</h3>
                            <svg viewBox="0 0 44 44" fill="none" className="stages-open" xmlns="http://www.w3.org/2000/svg">
                                <path d="M6.48391 12.7167C6.30888 12.5513 6.10299 12.422 5.87799 12.3361C5.65299 12.2503 5.41328 12.2096 5.17256 12.2164C4.93184 12.2233 4.69482 12.2774 4.47503 12.3758C4.25524 12.4742 4.05698 12.615 3.89158 12.79C3.72618 12.965 3.59688 13.1709 3.51105 13.3959C3.42522 13.6209 3.38455 13.8606 3.39136 14.1014C3.39817 14.3421 3.45232 14.5791 3.55074 14.7989C3.64915 15.0187 3.78988 15.2169 3.96492 15.3823L20.4649 30.9657C20.8053 31.2875 21.256 31.4668 21.7244 31.4668C22.1929 31.4668 22.6435 31.2875 22.9839 30.9657L39.4857 15.3823C39.6646 15.218 39.809 15.0198 39.9107 14.7992C40.0123 14.5786 40.069 14.34 40.0777 14.0973C40.0863 13.8546 40.0466 13.6126 39.9609 13.3853C39.8752 13.1581 39.7452 12.9501 39.5784 12.7735C39.4117 12.5969 39.2115 12.4552 38.9895 12.3567C38.7676 12.2581 38.5282 12.2046 38.2854 12.1993C38.0426 12.194 37.8011 12.237 37.5751 12.3258C37.349 12.4147 37.1429 12.5475 36.9686 12.7167L21.7244 27.112L6.48391 12.7167Z" />
                            </svg>
                        </div>
                        <div className="stages-text-container">
                            <p className="stages-name stages-name-paragraph">Включает в себя предварительную оценку поведения питомца и условий его содержания. Определение поведенческих проблем и объяснение процесса работы. При необходимости будет рекомендована консультация узких ветеринарных спеицалистов.</p>
                        </div>
                    </li>
                    <li className="stages-item">
                        <div className="stages-subtitle-container" onClick={handleTextOpen}>
                            <h3 className="stages-subtitle">2. Анкетирование</h3>
                            <svg viewBox="0 0 44 44" fill="none" className="stages-open" xmlns="http://www.w3.org/2000/svg">
                                <path d="M6.48391 12.7167C6.30888 12.5513 6.10299 12.422 5.87799 12.3361C5.65299 12.2503 5.41328 12.2096 5.17256 12.2164C4.93184 12.2233 4.69482 12.2774 4.47503 12.3758C4.25524 12.4742 4.05698 12.615 3.89158 12.79C3.72618 12.965 3.59688 13.1709 3.51105 13.3959C3.42522 13.6209 3.38455 13.8606 3.39136 14.1014C3.39817 14.3421 3.45232 14.5791 3.55074 14.7989C3.64915 15.0187 3.78988 15.2169 3.96492 15.3823L20.4649 30.9657C20.8053 31.2875 21.256 31.4668 21.7244 31.4668C22.1929 31.4668 22.6435 31.2875 22.9839 30.9657L39.4857 15.3823C39.6646 15.218 39.809 15.0198 39.9107 14.7992C40.0123 14.5786 40.069 14.34 40.0777 14.0973C40.0863 13.8546 40.0466 13.6126 39.9609 13.3853C39.8752 13.1581 39.7452 12.9501 39.5784 12.7735C39.4117 12.5969 39.2115 12.4552 38.9895 12.3567C38.7676 12.2581 38.5282 12.2046 38.2854 12.1993C38.0426 12.194 37.8011 12.237 37.5751 12.3258C37.349 12.4147 37.1429 12.5475 36.9686 12.7167L21.7244 27.112L6.48391 12.7167Z" />
                            </svg>
                        </div>
                        <div className="stages-text-container">
                            <p className="stages-name stages-name-paragraph">Этот этап является важным инструментом для понимания проблемы и разработки индивидуального подхода к каждому животному, учитывающий его уникальные особенности и потребности, что в конечном итоге улучшает результат работы и качество жизни питомца.</p>
                            <p className="stages-name">Собранная информация может помочь выявить потенциальные проблемы на ранних стадиях, что позволяет избежать более серьезных проблем в будущем и способствует долгосрочному благополучию животного.</p>
                            <p className="stages-name">Также, наличие четкой информации позволяет избежать путаницы и забывчивости, что особенно важно, если проблема поведения сложная и многогранная. </p>
                        </div>
                    </li>
                    <li className="stages-item">
                        <div className="stages-subtitle-container" onClick={handleTextOpen}>
                            <h3 className="stages-subtitle">3. Консультация и практическая работа</h3>
                            <svg viewBox="0 0 44 44" fill="none" className="stages-open" xmlns="http://www.w3.org/2000/svg">
                                <path d="M6.48391 12.7167C6.30888 12.5513 6.10299 12.422 5.87799 12.3361C5.65299 12.2503 5.41328 12.2096 5.17256 12.2164C4.93184 12.2233 4.69482 12.2774 4.47503 12.3758C4.25524 12.4742 4.05698 12.615 3.89158 12.79C3.72618 12.965 3.59688 13.1709 3.51105 13.3959C3.42522 13.6209 3.38455 13.8606 3.39136 14.1014C3.39817 14.3421 3.45232 14.5791 3.55074 14.7989C3.64915 15.0187 3.78988 15.2169 3.96492 15.3823L20.4649 30.9657C20.8053 31.2875 21.256 31.4668 21.7244 31.4668C22.1929 31.4668 22.6435 31.2875 22.9839 30.9657L39.4857 15.3823C39.6646 15.218 39.809 15.0198 39.9107 14.7992C40.0123 14.5786 40.069 14.34 40.0777 14.0973C40.0863 13.8546 40.0466 13.6126 39.9609 13.3853C39.8752 13.1581 39.7452 12.9501 39.5784 12.7735C39.4117 12.5969 39.2115 12.4552 38.9895 12.3567C38.7676 12.2581 38.5282 12.2046 38.2854 12.1993C38.0426 12.194 37.8011 12.237 37.5751 12.3258C37.349 12.4147 37.1429 12.5475 36.9686 12.7167L21.7244 27.112L6.48391 12.7167Z" />
                            </svg>
                        </div>
                        <div className="stages-text-container">
                            <p className="stages-name stages-name-paragraph">Онлайн консультация подходит для владельцев, выезд к которым невозможен в связи удаленностью расположения или по другим причинам. Такой формат работы позволяет задать вопросы и обсудить поведение питомца в комфортной обстановке. Мы обсуждаем план действий, который владельцы смогут реализовать самостоятельно. Важно, чтобы была возможность показать животное и его поведение через видеосвязь. </p>
                            <p className="stages-name">Очная консультация имеет преимущества в возможности наблюдения за питомцем в его привычной обстановке и проведения практических занятий. На занятии мы активно включаем в процесс владельцев, в выполнении упражнений и обучении новому поведению. </p>
                            <p className="stages-name">Также, есть отдельный формат тренировок с питомцем, если по каким-либо причинам владелец не может заниматься самостоятельно. Включающий в себя как работу с поведением, так и дрессировку.</p>
                        </div>
                    </li>
                    <li className="stages-item">
                        <div className="stages-subtitle-container" onClick={handleTextOpen}>
                            <h3 className="stages-subtitle">4. Разработка рекомендаций</h3>
                            <svg viewBox="0 0 44 44" fill="none" className="stages-open" xmlns="http://www.w3.org/2000/svg">
                                <path d="M6.48391 12.7167C6.30888 12.5513 6.10299 12.422 5.87799 12.3361C5.65299 12.2503 5.41328 12.2096 5.17256 12.2164C4.93184 12.2233 4.69482 12.2774 4.47503 12.3758C4.25524 12.4742 4.05698 12.615 3.89158 12.79C3.72618 12.965 3.59688 13.1709 3.51105 13.3959C3.42522 13.6209 3.38455 13.8606 3.39136 14.1014C3.39817 14.3421 3.45232 14.5791 3.55074 14.7989C3.64915 15.0187 3.78988 15.2169 3.96492 15.3823L20.4649 30.9657C20.8053 31.2875 21.256 31.4668 21.7244 31.4668C22.1929 31.4668 22.6435 31.2875 22.9839 30.9657L39.4857 15.3823C39.6646 15.218 39.809 15.0198 39.9107 14.7992C40.0123 14.5786 40.069 14.34 40.0777 14.0973C40.0863 13.8546 40.0466 13.6126 39.9609 13.3853C39.8752 13.1581 39.7452 12.9501 39.5784 12.7735C39.4117 12.5969 39.2115 12.4552 38.9895 12.3567C38.7676 12.2581 38.5282 12.2046 38.2854 12.1993C38.0426 12.194 37.8011 12.237 37.5751 12.3258C37.349 12.4147 37.1429 12.5475 36.9686 12.7167L21.7244 27.112L6.48391 12.7167Z" />
                            </svg>
                        </div>
                        <div className="stages-text-container">
                            <p className="stages-name stages-name-paragraph">После консультации и тщательного анализа проблемы, на основе полученных данных составляется выписка ( в согласованные с владельцем сроки), в которой содержится информация о самой консультации, а также индивидуальный план работы, включающий рекомендации, домашние задания.</p>
                            <span className="stages-name-alert">*Входит в очный формат </span>
                        </div>
                    </li>
                    <li className="stages-item">
                        <div className="stages-subtitle-container" onClick={handleTextOpen}>
                            <h3 className="stages-subtitle">5. Сопровождение</h3>
                            <svg viewBox="0 0 44 44" fill="none" className="stages-open" xmlns="http://www.w3.org/2000/svg">
                                <path d="M6.48391 12.7167C6.30888 12.5513 6.10299 12.422 5.87799 12.3361C5.65299 12.2503 5.41328 12.2096 5.17256 12.2164C4.93184 12.2233 4.69482 12.2774 4.47503 12.3758C4.25524 12.4742 4.05698 12.615 3.89158 12.79C3.72618 12.965 3.59688 13.1709 3.51105 13.3959C3.42522 13.6209 3.38455 13.8606 3.39136 14.1014C3.39817 14.3421 3.45232 14.5791 3.55074 14.7989C3.64915 15.0187 3.78988 15.2169 3.96492 15.3823L20.4649 30.9657C20.8053 31.2875 21.256 31.4668 21.7244 31.4668C22.1929 31.4668 22.6435 31.2875 22.9839 30.9657L39.4857 15.3823C39.6646 15.218 39.809 15.0198 39.9107 14.7992C40.0123 14.5786 40.069 14.34 40.0777 14.0973C40.0863 13.8546 40.0466 13.6126 39.9609 13.3853C39.8752 13.1581 39.7452 12.9501 39.5784 12.7735C39.4117 12.5969 39.2115 12.4552 38.9895 12.3567C38.7676 12.2581 38.5282 12.2046 38.2854 12.1993C38.0426 12.194 37.8011 12.237 37.5751 12.3258C37.349 12.4147 37.1429 12.5475 36.9686 12.7167L21.7244 27.112L6.48391 12.7167Z" />
                            </svg>
                        </div>
                        <div className="stages-text-container">
                            <p className="stages-name stages-name-paragraph">Анализируем изменения в поведении питомца, оцениваем результаты и, если требуется, акцентируем внимание на областях требующих дополнительной работы. При необходимости, мы корректируем ранее составленный чек-лист, а также, можем порекомендавать дополнительные упражнения для закрепления навыков.</p>
                            <p className="stages-name"><span className="steges-text-alert">*Полное сопровождение с обратной связью доступно только при личном ведении</span>животного в течение практической работы с ним</p>
                        </div>
                    </li>
                </ul>
            </div>
        </section>
    )
}

export default Stages;
