import Img1 from "../media/helpyou-media/agressive.png";
import Img2 from "../media/helpyou-media/with_dog.png";
import Img3 from "../media/helpyou-media/night.png";
import Img4 from "../media/helpyou-media/choose.png";
import Img5 from "../media/helpyou-media/dressirovka.png";
import Img6 from "../media/helpyou-media/equip.png";
import Img7 from "../media/helpyou-media/fear.png";
import Img8 from "../media/helpyou-media/adoptation.png";
import Img9 from "../media/helpyou-media/razr_pov.png";
import Img10 from "../media/helpyou-media/exotic.png";
import Img11 from "../media/helpyou-media/nechist_pov.png";
import Img12 from "../media/helpyou-media/compulsive.png";

const helpyou = [
  {
    text: "Обучение кошки различным трюкам, которые помогут комфортно жить на одной территории, удовлетворить потребность в активности, улучшить взаимоотношения с кошкой.",
    title: "Трюковая дрессировка",
    imgUrl: Img5,
    _id: 0,
  },
  {
    text: "Нападет на хозяина, ребенка, гостей. Агрессия к другим животным. Шипит, не дает к себе прикасаться.",
    title: "Агрессивное поведение",
    imgUrl: Img1,
    _id: 1,
  },
  {
    text: "Кошка боится собаки или нападает на нее. Кошка не принимает новую кошку. Хочется взять нового питомца, но не знаете, кто лучше подойдет.",
    title: "Знакомство кошки с другими животными",
    imgUrl: Img2,
    _id: 2,
  },
  {
    text: "Кошка не дает спать ночью, бегает, громко мяукает.",
    title: "Ночная активность",
    imgUrl: Img3,
    _id: 3,
  },
  {
    text: "Помощь в подборе породы, консультация по правильному воспитанию и уходу за котятами, чтобы избежать проблем в будущем.",
    title: "Подбор породы, воспитание и уход за котенком",
    imgUrl: Img4,
    _id: 4,
  },
  {
    text: "Навязчивые действия, хождение по кругу и другие поведенческие ритуалы.",
    title: "Компульсивные поведенческие расстройства",
    imgUrl: Img12,
    _id: 5,
  },
  {
    text: "Приручение к переноске, транспортировочному боксу, шлейке, купанию, стрижке когтей и пр. ",
    title: "Приручение к уходу и экипировке",
    imgUrl: Img6,
    _id: 6,
  },
  {
    text: "  Боится звука домофона, переноски, чужих людей, часто прячется.",
    title: "Любые страхи",
    imgUrl: Img7,
    _id: 7,
  },
  {
    text: "Кошка не подпускает к себе, прячется. Долго привыкает к новому дому. Адаптация и интеграция уличной кошки в доме.",
    title: "Проблемы с адаптацией",
    imgUrl: Img8,
    _id: 8,
  },
  {
    text: "Портит мебель, вещи, обдирает обои, скидывает предметы, выдергивает растения, грызет провода, открывает холодильник.",
    title: "Разрушительное поведение",
    imgUrl: Img9,
    _id: 9,
  },
  {
    text: "Налаживание взаимоотношений со взрослыми животными.",
    title: "Экзотические породы кошек в доме",
    imgUrl: Img10,
    _id: 10,
  },
  {
    text: "Игнорирование лотка, метки, ходит в туалет в разные места, на кровать, на диван, в том числе после кастрации. Приручение котят к лотку.",
    title: "Нечистоплотное поведение",
    imgUrl: Img11,
    _id: 11,
  },
  // {
  //   text: "Навязчивые действия, хождение по кругу и другие поведенческие ритуалы.",
  //   title: "Компульсивные поведенческие расстройства",
  //   imgUrl: Img12,
  //   _id: 12,
  // },
];

export default helpyou;
