import result1 from "../media/result-cards/result_1.png";
import result11 from "../media/result-cards/result_11.mp4";
import result2 from "../media/result-cards/result_2.png";
import result22 from "../media/result-cards/result_22.mp4";
import result23 from "../media/result-cards/result_23.mp4";
import result24 from "../media/result-cards/result_24.jpg";
import result3 from "../media/result-cards/result_3.png";
import result31 from "../media/result-cards/result_31.mp4";
import result4 from "../media/result-cards/result_4.png";
import result41 from "../media/result-cards/result_41.mp4";
import result51 from "../media/result-cards/result_51.mp4";
import result52 from "../media/result-cards/result_52.mp4";
import result6 from "../media/result-cards/result_6.png";
import result60 from "../media/result-cards/result_60.mp4";
import result61 from "../media/result-cards/result_61.jpg";
import result7 from "../media/result-cards/result_7.mp4";
import result71 from "../media/result-cards/result_71.mp4";

const resultCards = [
  {
    resultUrl: [result11, result1],
    resultTitle: "Кошечка золотая шиншилла",
    resultText: [
      {
        "Проблема:": [
          "С самого детства была жуткой шкодницей.",
          "Перестала ходить в лоток. Писает на кровать, на личные вещи, ковры в комнате. Ситуация усугубляется тем, что пописы переходят на другие комнаты и в разные места (под ванную, в ящики).",
          "Прыгает на обои, ободрав их все в доме.",
        ],
      },
      {
        "Решение:": [
          "Проведена детальная диагностика причин нечистоплотности, включая физиологические и стрессовые факторы.",
          "Организована корректная система лотков с учётом предпочтений кошки.",
          "Пространство адаптировано под ее потребности: добавлены альтернативные места для лазания и активных игр.",
          "Проработаны взаимоотношения с членом семьи, что помогло устранить стрессовый фактор.",
        ],
      },
      {
        "Результаты:": [
          "Кошка полностью вернулась к использованию лотка, прекратила метить вещи и портить обои.",
          "Прыжки по стенам прекратились, а её активность теперь направлена на безопасные игровые занятия.",
        ],
      },
    ],
    _id: 1,
  },
  {
    resultUrl: [result22, result23, result2, result24],
    resultTitle: "Перезнакомство двух бенгальских котиков",
    resultText: [
      {
        "Проблема:": [
          "Как только они друг друга видят, готовы друг друга убить, рычат, шипят. Подрались несколько раз.",
          "На видео второй котик находится за дверью во избежании повторных драк.",
        ],
      },
      {
        "Решение:": [
          "Проведена адаптация нового питомца в доме. Создана безопасная среда, исключающая триггеры агрессии.",
          "Перезнакомство организовано поэтапно с учётом комфортной дистанции для каждого кота.",
          "Использованы контролируемые визуальные контакты и положительное подкрепление за спокойное поведение.",
        ],
      },
      {
        "Результаты:": [
          "Могут вместе находиться в одной комнате, спать.",
          "Нападения полностью прекратились.",
        ],
      },
    ],
    _id: 2,
  },
  {
    resultUrl: [result31, result3],
    resultTitle: "Котенок каракала, 3.5 мес",
    resultText: [
      {
        "Проблема:": [
          "Всего боится, рычит, шипит, проявляет агрессию, не дается взять в руки.",
        ],
      },
      {
        "Решение:": [
          "Проведена адаптация и выработана установка на обучение.",
          "Создана спокойная и предсказуемая среда, введён режим игр и тренировок.",
          "Начато постепенное обучение тактильному контакту через формирование положительных ассоциаций.",
        ],
      },
      {
        "Промежуточные результаты:": [
          "Котенок стал спокойнее рядом с людьми, особенно с хозяйкой: спит с ней, даётся гладить без агрессии.",
          "Проявляет меньше страха и уже подпускает к себе супруга.",
        ],
      },
    ],
    _id: 3,
  },
  {
    resultUrl: [result4, result41],
    resultTitle: "Девочка, азиатский леопардовый кот",
    resultText: [
      {
        "Проблема:": [
          "Кусается, не дает себя гладить, шипит, прячется от людей.",
        ],
      },
      {
        "Решение:": [
          "Выявлены и снижены стрессовые триггеры. ",
          "Разработаны игровые методы, способствующие формированию доверия и постепенному сокращению дистанции между человеком и кошкой.",
        ],
      },
      {
        "Промежуточный результат:": [
          "Налажен тактильный контакт, начата работа со страхом новых людей.",
        ],
      },
    ],
    _id: 4,
  },
  {
    resultUrl: [result51, result52],
    resultTitle: "Кот саванна",
    resultText: [
      {
        "Проблема:": [
          "Нечистоплотное поведение, пописы на кровать, шторы, одежду, углы.",
          "Не подходит близко, невозможно прикоснуться, проявляет агрессию.",
        ],
      },
      {
        "Решение:": [
          "Внедрены упражнения для формирования доверия к человеку.",
          "Реализирована интеллектуальная нагрузка, активность выстроена по режиму.",
          "Проведены тренировки, укрепляющие положительные ассоциации с человеком. Выявлены и устранены ключевые стрессовые триггеры, влияющие на нечистоплотность.",
        ],
      },
      {
        "Промежуточные результаты:": [
          "Пописы кратно сократились.",
          "Кот может расслабленно лежать и засыпать рядом, начато приучение к тактильному контакту.",
        ],
      },
    ],
    _id: 5,
  },
  {
    resultUrl: [result60, result61, result6],
    resultTitle: "Кошка сфинкс",
    resultText: [
      {
        "Проблема:": [
          "Не дает себя гладить, сразу кусает.",
          "Когда заигрывается, начинает сильно нападать.",
          "Будит в 5 утра играми, трется носом, чтобы уделили внимание и покормили.",
          "Не может оставаться за закрытой дверью, шкребется.",
          "Раскапывает землю в цветах.",
        ],
      },
      {
        "Решение:": [
          "Проведена работа с гиперактивностью и перенаправлением энергии в конструктивное русло.",
          "Внедрены структурированные игровые сессии, снижена потребность в ночной активности за счёт корректировки режима дня.",
          "Начато обучение спокойному восприятию тактильного контакта.",
          "Выстроена система альтернативных занятий, предотвращающая разрушительное поведение.",
        ],
      },
      {
        "Результаты:": [
          "Перестала будить утром, может спокойно реагировать на тактильный контакт.",
          "Перестала копать цветочные горшки.",
          "Вместо покусов направляет свою энергию на безопасные игры с игрушками.",
        ],
      },
    ],
    _id: 6,
  },
  {
    resultUrl: [result7, result71],
    resultTitle: "Кошка саванна, 1 год",
    resultText: [
      {
        "Проблема:": [
          "Не подпускает к себе подойти ближе, чем на метр. Рычит, шипит.",
          "Избегает зрительного контакта.",
        ],
      },
      {
        "Решение:": [
          "Выстроена работа с формированием доверия.",
          "Обеспечена интеллектуальная нагрузка и структурированная активность.",
          "Проведены упражнения, закрепляющие любопытство к человеку.",
          "Сформирована положительная ассоциация с прикосновениями.",
          "Разучено несколько команд, стимулирующих кошку самостоятельно инициировать тактильный контакт.",
        ],
      },
      {
        "Результаты:": [
          "Подходит сама, спокойно реагирует на тесный контакт, поглаживания."
        ],
      },
    ],
    _id: 7,
  },
];

export default resultCards;
